{
	"version": "https://jsonfeed.org/version/1",
	"title": "watch this space!",
	"icon": "https://avatars.micro.blog/avatars/2025/39/1828167.jpg",
	"home_page_url": "https://andrewfordlyons.net/",
	"feed_url": "https://andrewfordlyons.net/feed.json",
	"items": [
		
			{
				"id": "http://drew3000.micro.blog/2025/10/27/hello-yet-again-cruel-world.html",
				"title": "Hello yet again, cruel world",
				"content_html": "<p><strong>This is an obligatory blog launch post.</strong> The old blog is dead. Here&rsquo;s the new one. I&rsquo;ve once more moved platforms and domains. Welcome to the new show. The <a href=\"https://dystopia.report/\">old website</a> is now retired and the Internet Archive serves its <a href=\"https://web.archive.org/web/20250000000000*/dystopia.report\">backup repository</a>. I hop from one online publishing platform to another almost more often than I post on any of them, forever dazzled by the shiny new thing. The last one was on <a href=\"https://ghost.org/\">Ghost</a>, this one is using <a href=\"https://micro.blog/\">micro.blog</a>. Instead of going for some kind of ironically recursive domain, this time I&rsquo;ve opted for a self-inflicted  <em>real names</em> policy. It me.</p>\n<p>I didn&rsquo;t quit Ghost because I didn&rsquo;t like it. It offers a super online publishing experience. If you want to build audience, monetise content, develop a good e-newsletter following, Ghost is your bag. It&rsquo;s open source if you want to self-host, is heading down a federated content syndication path, and has really good pricing tiers depending on how pro you want to go. <a href=\"https://justincox.com/blog/2025/08/is-substack-really-that-bad/\">It&rsquo;s also not evil</a>.</p>\n<p>But I&rsquo;m not in the monetisable content racket <em>(not that I&rsquo;ll refuse cash, mind you!)</em>. I don&rsquo;t have <em>an audience</em>. I&rsquo;m not terribly interested in growing one, either. I&rsquo;m presently fine with just doing my part to contribute to the overall online din. But I am really interested in syndication. The drawing appeal to micro.blog wasn&rsquo;t the posting GUI (it&rsquo;s winning awards in minimalism!) or design, but rather what&rsquo;s under the hood. It takes federated posting very seriously, incorporating <a href=\"https://activitypub.rocks/\">ActivityPub</a> and playing really nicely with <a href=\"https://atproto.com/\">ATProto</a> and <a href=\"https://nostr.how/en/the-protocol\">Nostr</a> protocol platforms. In this iteration of the blog, I&rsquo;m far less bothered by how the content looks on its own WeBlog, and more curious about where it can go and how far it can travel across decentralised, federated services. Real nerd stuff, but as online publishing and social posting merge, it becomes more and more important to not be locked into, or at the mercy of, a single corporate platform or a small set of them that can wipe you off the internet in a single moderator&rsquo;s decision.</p>\n<p>If Meta&rsquo;s Threads decides to hate me, this rant can still run through federated sharing on Mastodon, find a spot on Bluesky, or any number of Nostr clients. It&rsquo;s alll movable, exportable and self-hostable should it come to that.  This becomes pressing as more governments around the world are finding their <a href=\"https://bens.org/balkanization-of-internet-pt1/\">tolerance limits of an unrestricted global internet</a>.  We need better protocols that aren&rsquo;t dependent on the same centralised and easily firewalled gateways.</p>\n<p>That aside, micro.blog also allows for a nice mix of pint-sized <em>social</em> posts and long blogs all in one interface, has a mercifully useable posting app that&rsquo;s about as simple as posting a tweet, toot, or skeet, and is nicely open source and maintained by friendly developers who actually respond to bug reports. So here&rsquo;s where the show will be for a while, as always developing the site, breaking it, trying things, failing at it, adding and removing stuff all on main, before a live studio audience.</p>\n<p>Watch this space.</p>\n<img src=\"uploads/2025/cant-stop-the-signal.gif\" alt=\"You Can't stop the Signal, Mal.\">\n",
				"content_text": "**This is an obligatory blog launch post.** The old blog is dead. Here's the new one. I've once more moved platforms and domains. Welcome to the new show. The [old website](https://dystopia.report/) is now retired and the Internet Archive serves its [backup repository](https://web.archive.org/web/20250000000000*/dystopia.report). I hop from one online publishing platform to another almost more often than I post on any of them, forever dazzled by the shiny new thing. The last one was on [Ghost](https://ghost.org/), this one is using [micro.blog](https://micro.blog/). Instead of going for some kind of ironically recursive domain, this time I've opted for a self-inflicted  _real names_ policy. It me.\n\nI didn't quit Ghost because I didn't like it. It offers a super online publishing experience. If you want to build audience, monetise content, develop a good e-newsletter following, Ghost is your bag. It's open source if you want to self-host, is heading down a federated content syndication path, and has really good pricing tiers depending on how pro you want to go. [It's also not evil](https://justincox.com/blog/2025/08/is-substack-really-that-bad/).\n\nBut I'm not in the monetisable content racket _(not that I'll refuse cash, mind you!)_. I don't have _an audience_. I'm not terribly interested in growing one, either. I'm presently fine with just doing my part to contribute to the overall online din. But I am really interested in syndication. The drawing appeal to micro.blog wasn't the posting GUI (it's winning awards in minimalism!) or design, but rather what's under the hood. It takes federated posting very seriously, incorporating [ActivityPub](https://activitypub.rocks/) and playing really nicely with [ATProto](https://atproto.com/) and [Nostr](https://nostr.how/en/the-protocol) protocol platforms. In this iteration of the blog, I'm far less bothered by how the content looks on its own WeBlog, and more curious about where it can go and how far it can travel across decentralised, federated services. Real nerd stuff, but as online publishing and social posting merge, it becomes more and more important to not be locked into, or at the mercy of, a single corporate platform or a small set of them that can wipe you off the internet in a single moderator's decision.\n\nIf Meta's Threads decides to hate me, this rant can still run through federated sharing on Mastodon, find a spot on Bluesky, or any number of Nostr clients. It's alll movable, exportable and self-hostable should it come to that.  This becomes pressing as more governments around the world are finding their [tolerance limits of an unrestricted global internet](https://bens.org/balkanization-of-internet-pt1/).  We need better protocols that aren't dependent on the same centralised and easily firewalled gateways.\n\nThat aside, micro.blog also allows for a nice mix of pint-sized _social_ posts and long blogs all in one interface, has a mercifully useable posting app that's about as simple as posting a tweet, toot, or skeet, and is nicely open source and maintained by friendly developers who actually respond to bug reports. So here's where the show will be for a while, as always developing the site, breaking it, trying things, failing at it, adding and removing stuff all on main, before a live studio audience.\n\nWatch this space.\n\n<img src=\"uploads/2025/cant-stop-the-signal.gif\" alt=\"You Can't stop the Signal, Mal.\">\n",
				"date_published": "2025-10-27T23:11:13+00:00",
				"url": "https://andrewfordlyons.net/2025/10/27/hello-yet-again-cruel-world.html",
				"tags": ["Mise en abyme"]
			},
			{
				"id": "http://drew3000.micro.blog/2025/10/19/scifi-is-is-commentary-on.html",
				
				"content_html": "<p>Sci-fi is is commentary on real world events. It&rsquo;s only escapism to people who already have checked out anyway.</p>\n<img src=\"uploads/2025/c724b76f4e.jpg\" width=\"600\" height=\"537\" alt=\"&10;Screenwriter Tony Gilroy discusses the making of Andor and its themes of authoritarian resistance in front of a crowd in Los Angeles....&10;2hago 17.42 EDT&10;By Lauren Gambino&10;Screenwriter and director Tony Gilroy, who created the Star Wars series Andor, was among the thousands of people who gathered in downtown Los Angeles on Saturday afternoon for the No Kings protest.&10;&10;Andor, starring Diego Luna as the protagonist, follows Cassian Andor’s journey as a thief-turned-spy for the Rebel Alliance - the good guys whose ranks eventually go on to include characters such as Luke Skywalker, Princess Leia and Han Solo - in a crusade to take down the Galactic Empire.&10;“We spent six years making a show about the fascist takeover of a galaxy, far, far away,” he said. “We didn’t think we were making a documentary.” Gilroy said the show offered a clear model for what authoritarian rule looks like - and how to resist it. “We spent a lot of time thinking about sacrifice and courage, and the incremental encroachment of authoritarianism and how it works,” he said. “&10;I think I would have been here anyway, but the show has only amplified my understanding of it - my understanding of the sort of karaoke fascist playbook, but also my appreciation for the varieties of courage it takes for people to resist.”&10;Gilroy was dismayed by the “vacuum” of leadership among the anti-Trump resistance but saw reason to be hopeful as he looked out at the gathering crowd of Angelenos waving American flags and No Kings posters.\">\n",
				"content_text": "Sci-fi is is commentary on real world events. It's only escapism to people who already have checked out anyway.\n\n<img src=\"uploads/2025/c724b76f4e.jpg\" width=\"600\" height=\"537\" alt=\"&10;Screenwriter Tony Gilroy discusses the making of Andor and its themes of authoritarian resistance in front of a crowd in Los Angeles....&10;2hago 17.42 EDT&10;By Lauren Gambino&10;Screenwriter and director Tony Gilroy, who created the Star Wars series Andor, was among the thousands of people who gathered in downtown Los Angeles on Saturday afternoon for the No Kings protest.&10;&10;Andor, starring Diego Luna as the protagonist, follows Cassian Andor’s journey as a thief-turned-spy for the Rebel Alliance - the good guys whose ranks eventually go on to include characters such as Luke Skywalker, Princess Leia and Han Solo - in a crusade to take down the Galactic Empire.&10;“We spent six years making a show about the fascist takeover of a galaxy, far, far away,” he said. “We didn’t think we were making a documentary.” Gilroy said the show offered a clear model for what authoritarian rule looks like - and how to resist it. “We spent a lot of time thinking about sacrifice and courage, and the incremental encroachment of authoritarianism and how it works,” he said. “&10;I think I would have been here anyway, but the show has only amplified my understanding of it - my understanding of the sort of karaoke fascist playbook, but also my appreciation for the varieties of courage it takes for people to resist.”&10;Gilroy was dismayed by the “vacuum” of leadership among the anti-Trump resistance but saw reason to be hopeful as he looked out at the gathering crowd of Angelenos waving American flags and No Kings posters.\">\n",
				"date_published": "2025-10-19T11:20:41+00:00",
				"url": "https://andrewfordlyons.net/2025/10/19/scifi-is-is-commentary-on.html",
				"tags": ["Andor"]
			},
			{
				"id": "http://drew3000.micro.blog/2025/10/19/hoppy-halloween.html",
				
				"content_html": "<p>Hoppy Halloween!</p>\n<img src=\"uploads/2025/993ffc48c6.png\" width=\"506\" height=\"600\" alt=\"A packaged inflatable frog costume humorously labeled as a Violent Antifa Terrorist, including a cape and an air pump, is shown with a parody description.\">\n",
				"content_text": "Hoppy Halloween!\n\n\n<img src=\"uploads/2025/993ffc48c6.png\" width=\"506\" height=\"600\" alt=\"A packaged inflatable frog costume humorously labeled as a Violent Antifa Terrorist, including a cape and an air pump, is shown with a parody description.\">\n",
				"date_published": "2025-10-18T23:15:56+00:00",
				"url": "https://andrewfordlyons.net/2025/10/19/hoppy-halloween.html"
			},
			{
				"id": "http://drew3000.micro.blog/2025/10/13/found-via-a-bluesky-user.html",
				
				"content_html": "<p>Found via a Bluesky user who found it on FB. Whoever created it should get a PhD.</p>\n<img src=\"uploads/2025/8e187ebb93.png\" width=\"600\" height=\"314\" alt=\"A humorous meme contrasts the virgin 'AGI existential risk' with the 'Chad Global Warming', using exaggerated cartoon characters and text to highlight differences in perceived threats.\">\n",
				"content_text": "Found via a Bluesky user who found it on FB. Whoever created it should get a PhD.\n\n<img src=\"uploads/2025/8e187ebb93.png\" width=\"600\" height=\"314\" alt=\"A humorous meme contrasts the virgin 'AGI existential risk' with the 'Chad Global Warming', using exaggerated cartoon characters and text to highlight differences in perceived threats.\">\n",
				"date_published": "2025-10-13T15:41:56+00:00",
				"url": "https://andrewfordlyons.net/2025/10/13/found-via-a-bluesky-user.html",
				"tags": ["AI"]
			},
			{
				"id": "http://drew3000.micro.blog/2025/10/12/huwaidas-a-political-prisoner-abducted.html",
				
				"content_html": "<p>Huwaida&rsquo;s a political prisoner. Abducted by Israel&rsquo;s occupation forces from international waters for nonviolent direct action against a genocide.\n#FreeHuwaida</p>\n<img src=\"uploads/2025/a3e73f1de7.png\" width=\"600\" height=\"598\" alt=\"Free the US Citizen Huwaida Arraf&10;Abducted by Israel from international waters&10;Held hostage in brutal Shikma Prison\">\n",
				"content_text": "Huwaida's a political prisoner. Abducted by Israel's occupation forces from international waters for nonviolent direct action against a genocide.\n#FreeHuwaida\n\n<img src=\"uploads/2025/a3e73f1de7.png\" width=\"600\" height=\"598\" alt=\"Free the US Citizen Huwaida Arraf&10;Abducted by Israel from international waters&10;Held hostage in brutal Shikma Prison\">\n",
				"date_published": "2025-10-12T01:19:33+00:00",
				"url": "https://andrewfordlyons.net/2025/10/12/huwaidas-a-political-prisoner-abducted.html"
			},
			{
				"id": "http://drew3000.micro.blog/2025/10/10/uncritical-adoption-of-ai-will.html",
				
				"content_html": "<blockquote>\n<p>&ldquo;Uncritical adoption of AI, will inevitably create people without critical thinking, and this may be a feature - not a bug, as it represents an attack on human agency itself.&rdquo; <strong>— Angelos Arnis, in <em><a href=\"https://collectivefutures.blog/the-infrastructure-of-meaninglessness/\">The infrastructure of meaninglessness</a></em></strong></p>\n</blockquote>\n",
				"content_text": "> \"Uncritical adoption of AI, will inevitably create people without critical thinking, and this may be a feature - not a bug, as it represents an attack on human agency itself.\" **— Angelos Arnis, in _[The infrastructure of meaninglessness](https://collectivefutures.blog/the-infrastructure-of-meaninglessness/)_**\n",
				"date_published": "2025-10-10T22:12:46+00:00",
				"url": "https://andrewfordlyons.net/2025/10/10/uncritical-adoption-of-ai-will.html"
			},
			{
				"id": "http://drew3000.micro.blog/2025/10/01/a-guide-for-the-america.html",
				"title": "A guide for the America you got, not the one you want",
				"content_html": "<p>This is a timely resource from <a href=\"https://activistchecklist.org/\">Activist Checklist</a>, an online resource for activists and by activists who started developing guides and materials last year when it looked increasingly more likely that the U.S. was on the verge of where it now is: sliding further into authoritarianism, state surveillance of various groups, and repression against social movements. It&rsquo;s the <strong><a href=\"https://activistchecklist.org/police/\">&ldquo;Police at the Door&rdquo; Know Your Rights Poster</a>!</strong></p>\n<p>The web page is full of good advice and further links on how to deal with the event of  the FBI, ICE, local police or any other cop-coded government agents showing up on your stoop. It comes with a handy PDF to print, add some important phone numbers you&rsquo;d want to have ready, and stick on the fridge. It&rsquo;s got some quickly digestible reminders about your rights and how to handle the situation, bearing in mind that some of them (hi ICE) <a href=\"https://www.gofundme.com/f/help-barbara-fight-for-her-future-after-ice-detention\">don&rsquo;t necessarily follow the rules</a>.</p>\n<p>This comes as White House rhetoric gets more heated about deploying the military against the &ldquo;<a href=\"https://www.npr.org/2025/10/01/nx-s1-5558336/trump-says-u-s-military-should-be-used-to-fight-the-enemy-within\">enemy within</a>,&rdquo; publishing a <a href=\"https://theconversation.com/political-witch-hunts-and-blacklists-donald-trump-and-the-new-era-of-mccarthyism-265389\">McCarthyist</a> Presidential memorandum titled &ldquo;<a href=\"https://www.whitehouse.gov/presidential-actions/2025/09/enforcing-the-death-penalty-laws-in-the-district-of-columbia-to-deter-and-punish-the-most-heinous-crimes/\">Countering Domestic Terrorism and Organized Political Violence</a>,&rdquo; and <a href=\"https://www.cbc.ca/news/world/trump-national-guard-training-ground-us-cities-1.7647736\">threatened to target civilians in U.S. cities with military force</a>. The scolders who said people were exaggerating about what the world would be like with this administration should be donating to the legal funds for anyone it targets.</p>\n<p>What&rsquo;s useful about the &ldquo;Police At The Door&rdquo; guide is that it&rsquo;s aimed at preparation, and is open about how unpredictable the situation can be. The feds may not knock. You might want to record the unfolding incident, but unlocking your mobile with cops in the room waving a warrant around can be a risk amplifier. All useful things to game out before the bad thing happens. Mitigation never happens on the day without homework before.</p>\n<p>So there&rsquo;s that.</p>\n<img src=\"https://andrewfordlyons.net/uploads/2025/c62f66167c.png\" alt=\"This is an image of the Activist Checklist resource that provides detailed steps and tips for handling encounters with law enforcement at your door, emphasizing your rights and actions to take.\">\n",
				"content_text": "This is a timely resource from [Activist Checklist](https://activistchecklist.org/), an online resource for activists and by activists who started developing guides and materials last year when it looked increasingly more likely that the U.S. was on the verge of where it now is: sliding further into authoritarianism, state surveillance of various groups, and repression against social movements. It's the **[\"Police at the Door\" Know Your Rights Poster](https://activistchecklist.org/police/)!**\n\nThe web page is full of good advice and further links on how to deal with the event of  the FBI, ICE, local police or any other cop-coded government agents showing up on your stoop. It comes with a handy PDF to print, add some important phone numbers you'd want to have ready, and stick on the fridge. It's got some quickly digestible reminders about your rights and how to handle the situation, bearing in mind that some of them (hi ICE) [don't necessarily follow the rules](https://www.gofundme.com/f/help-barbara-fight-for-her-future-after-ice-detention). \n\nThis comes as White House rhetoric gets more heated about deploying the military against the \"[enemy within](https://www.npr.org/2025/10/01/nx-s1-5558336/trump-says-u-s-military-should-be-used-to-fight-the-enemy-within),\" publishing a [McCarthyist](https://theconversation.com/political-witch-hunts-and-blacklists-donald-trump-and-the-new-era-of-mccarthyism-265389) Presidential memorandum titled \"[Countering Domestic Terrorism and Organized Political Violence](https://www.whitehouse.gov/presidential-actions/2025/09/enforcing-the-death-penalty-laws-in-the-district-of-columbia-to-deter-and-punish-the-most-heinous-crimes/),\" and [threatened to target civilians in U.S. cities with military force](https://www.cbc.ca/news/world/trump-national-guard-training-ground-us-cities-1.7647736). The scolders who said people were exaggerating about what the world would be like with this administration should be donating to the legal funds for anyone it targets.\n\nWhat's useful about the \"Police At The Door\" guide is that it's aimed at preparation, and is open about how unpredictable the situation can be. The feds may not knock. You might want to record the unfolding incident, but unlocking your mobile with cops in the room waving a warrant around can be a risk amplifier. All useful things to game out before the bad thing happens. Mitigation never happens on the day without homework before.\n\nSo there's that.\n\n<img src=\"https://andrewfordlyons.net/uploads/2025/c62f66167c.png\" alt=\"This is an image of the Activist Checklist resource that provides detailed steps and tips for handling encounters with law enforcement at your door, emphasizing your rights and actions to take.\">\n",
				"date_published": "2025-10-01T21:40:05+00:00",
				"url": "https://andrewfordlyons.net/2025/10/01/a-guide-for-the-america.html"
			},
			{
				"id": "http://drew3000.micro.blog/2025/09/30/this-is-going-to-be.html",
				
				"content_html": "<blockquote>\n<p>&ldquo;This is going to be a big thing for the people in this room, because it&rsquo;s the enemy from within, and we have to handle it before it gets out of control.&rdquo;</p>\n</blockquote>\n<p>The White House has, in no uncertain terms, declared war on civilians inside the U.S. when the president addressed the nearly 800 military leaders in Pete&rsquo;s Department of War and Discount Goods.</p>\n<p>That&rsquo;s where we are.</p>\n<p>NPR, still existing for the time being, <a href=\"https://www.npr.org/2025/09/30/nx-s1-5557232/hegseth-generals-trump\">reports</a></p>\n<img src=\"https://andrewfordlyons.net/uploads/2025/image.gif\" width=\"540\" height=\"341\" alt=\"Saw Gurrera, in 'Andor', saying the line &quot;Let's call it... War.&quot;\">\n",
				"content_text": "> \"This is going to be a big thing for the people in this room, because it's the enemy from within, and we have to handle it before it gets out of control.\"\n\nThe White House has, in no uncertain terms, declared war on civilians inside the U.S. when the president addressed the nearly 800 military leaders in Pete's Department of War and Discount Goods.\n\nThat's where we are.\n\nNPR, still existing for the time being, [reports](https://www.npr.org/2025/09/30/nx-s1-5557232/hegseth-generals-trump)\n\n<img src=\"https://andrewfordlyons.net/uploads/2025/image.gif\" width=\"540\" height=\"341\" alt=\"Saw Gurrera, in 'Andor', saying the line &quot;Let's call it... War.&quot;\">\n",
				"date_published": "2025-09-30T16:33:46+00:00",
				"url": "https://andrewfordlyons.net/2025/09/30/this-is-going-to-be.html"
			},
			{
				"id": "http://drew3000.micro.blog/2025/09/29/the-taliban-has-virtually-cut.html",
				
				"content_html": "<p>The Taliban has virtually cut off everyone in the country from both the internet and mobile networks <a href=\"https://www.theguardian.com/world/2025/sep/29/afghanistan-communications-blackout-taliban-shuts-internet\">in the last couple of days</a>. These moves generally come before something a regime desperately doesn&rsquo;t want the world to see.</p>\n<img src=\"https://andrewfordlyons.net/uploads/2025/870315e40d.jpg\" width=\"600\" height=\"337\" alt=\"A network connectivity chart for Afghanistan between September 25 and September 29, 2025, shows a significant drop to 1% on the final day.\">\n",
				"content_text": "The Taliban has virtually cut off everyone in the country from both the internet and mobile networks [in the last couple of days](https://www.theguardian.com/world/2025/sep/29/afghanistan-communications-blackout-taliban-shuts-internet). These moves generally come before something a regime desperately doesn't want the world to see.\n\n<img src=\"https://andrewfordlyons.net/uploads/2025/870315e40d.jpg\" width=\"600\" height=\"337\" alt=\"A network connectivity chart for Afghanistan between September 25 and September 29, 2025, shows a significant drop to 1% on the final day.\">\n",
				"date_published": "2025-09-29T22:32:45+00:00",
				"url": "https://andrewfordlyons.net/2025/09/29/the-taliban-has-virtually-cut.html"
			},
			{
				"id": "http://drew3000.micro.blog/2025/09/29/this-is-amazing-considering-from.html",
				
				"content_html": "<p>This is amazing, considering from where the Gaza flotilla project originally began in 2010: A group of activists with a simple idea, very complex in execution, to just keep sending boats to Gaza, which never should have been blocked to begin with. It was ignored, criticized, and even assaulted many times over the years. This is perseverance.</p>\n<p><a href=\"https://www.reuters.com/world/middle-east/italy-sends-second-navy-ship-escort-gaza-aid-flotilla-2025-09-25/\">www.reuters.com/world/mid&hellip;</a></p>\n<img src=\"https://andrewfordlyons.net/uploads/2025/image.png\" width=\"515\" height=\"600\" alt=\"Novarra media:&10;Turkey becomes third country to provide navy support to flotilla (to Gaza)&10;&10;Image: A navy ship is sailing on the sea\">\n",
				"content_text": "This is amazing, considering from where the Gaza flotilla project originally began in 2010: A group of activists with a simple idea, very complex in execution, to just keep sending boats to Gaza, which never should have been blocked to begin with. It was ignored, criticized, and even assaulted many times over the years. This is perseverance.\n\n[www.reuters.com/world/mid...](https://www.reuters.com/world/middle-east/italy-sends-second-navy-ship-escort-gaza-aid-flotilla-2025-09-25/)\n\n\n<img src=\"https://andrewfordlyons.net/uploads/2025/image.png\" width=\"515\" height=\"600\" alt=\"Novarra media:&10;Turkey becomes third country to provide navy support to flotilla (to Gaza)&10;&10;Image: A navy ship is sailing on the sea\">\n",
				"date_published": "2025-09-29T20:01:44+00:00",
				"url": "https://andrewfordlyons.net/2025/09/29/this-is-amazing-considering-from.html"
			},
			{
				"id": "http://drew3000.micro.blog/2025/09/29/tip-for-civil-society-never.html",
				
				"content_html": "<blockquote>\n<p>&ldquo;Tip for Civil Society: Never Negotiate. Always make them do the bad thing. Don’t help them do it, but make their choice either: do something really bad, or nothing at all&rdquo; —<a href=\"https://alecmuffett.com/article/115274\">Alec Muffett</a></p>\n</blockquote>\n<p>There&rsquo;s no middle ground in privacy preserving software development, this is a good short post by Alec on that point.</p>\n",
				"content_text": "> \"Tip for Civil Society: Never Negotiate. Always make them do the bad thing. Don’t help them do it, but make their choice either: do something really bad, or nothing at all\" —[Alec Muffett](https://alecmuffett.com/article/115274)\n\nThere's no middle ground in privacy preserving software development, this is a good short post by Alec on that point.\n\n\n",
				"date_published": "2025-09-29T07:17:44+00:00",
				"url": "https://andrewfordlyons.net/2025/09/29/tip-for-civil-society-never.html"
			},
			{
				"id": "http://drew3000.micro.blog/2025/09/28/playing-with-microblog-to-see.html",
				
				"content_html": "<p>Playing with micro.blog to see how it pings across the different federated platforms. This is a test. There may be more.</p>\n",
				"content_text": "Playing with micro.blog to see how it pings across the different federated platforms. This is a test. There may be more.\n",
				"date_published": "2025-09-28T22:05:37+00:00",
				"url": "https://andrewfordlyons.net/2025/09/28/playing-with-microblog-to-see.html"
			},
			{
				"id": "http://drew3000.micro.blog/2025/09/27/no-blog-who-dis.html",
				
				"content_html": "<p>New blog, who dis?</p>\n",
				"content_text": "New blog, who dis?\n",
				"date_published": "2025-09-27T17:19:00+00:00",
				"url": "https://andrewfordlyons.net/2025/09/27/no-blog-who-dis.html"
			}
	]
}
